apache/nuttx/arch/risc-v/src/k210/k210_sysctl.c
/****************************************************************************
 * arch/risc-v/src/k210/k210_sysctl.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <nuttx/arch.h>

#include "riscv_internal.h"
#include "hardware/k210_sysctl.h"
#include "hardware/k210_memorymap.h"
#include "k210_sysctl.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define K210_PLL_INPUT_FREQ    26000000UL

#define K210_PLL_REF_MIN       13671900UL
#define K210_PLL_REF_MAX       1750000000ULL
#define K210_PLL_VCO_MIN       350000000ULL
#define K210_PLL_VCO_MAX       1750000000ULL

#define K210_PLL_NR_MIN        1
#define K210_PLL_NR_MAX        16
#define K210_PLL_NF_MIN        1
#define K210_PLL_NF_MAX        64
#define K210_PLL_OD_MIN        1
#define K210_PLL_OD_MAX        16

#define K210_PLL_LOCK_TIMEOUT_US 50000

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct k210_pll_params_s
{
  uint8_t clkr;
  uint8_t clkf;
  uint8_t clkod;
  uint8_t bwadj;
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: k210_sysctl_pll_get_freq
 *
 * Description:
 *   Calculate PLL output frequency from register fields.
 *
 *   Formula: FOUT = FIN * (CLKF + 1) / (CLKR + 1) / (CLKOD + 1)
 *   Where FIN = 26MHz (external crystal oscillator)
 *
 * Input Parameters:
 *   pll_offset - PLL register offset (K210_SYSCTL_PLL0/PLL1/PLL2)
 *
 * Returned Value:
 *   PLL output frequency in Hz
 *
 ****************************************************************************/

static uint32_t k210_sysctl_pll_get_freq(uint32_t pll_base)
{
  uint32_t regval = getreg32(pll_base);
  uint32_t clkr = (regval >> PLL_CLKR_SHIFT) & 0x0f;
  uint32_t clkf = (regval >> PLL_CLKF_SHIFT) & 0x3f;
  uint32_t clkod = (regval >> PLL_CLKOD_SHIFT) & 0x0f;

  return (K210_PLL_INPUT_FREQ * (clkf + 1)) / (clkr + 1) / (clkod + 1);
}

/****************************************************************************
 * Name: k210_clock_to_bit
 *
 * Description:
 *   Map a clock ID to its corresponding bit position in CLK_EN_PERI
 *   register.
 *
 * Input Parameters:
 *   clkid - Clock ID to map
 *   bit   - Pointer to store the bit position
 *
 * Returned Value:
 *   OK on success, -EINVAL for invalid clock ID
 *
 ****************************************************************************/

static int k210_clock_to_bit(k210_clockid_t clkid, uint32_t *bit)
{
  switch (clkid)
    {
      case K210_CLOCK_ROM:
        *bit = CLK_EN_PERI_ROM_SHIFT;
        break;
      case K210_CLOCK_DMA:
        *bit = CLK_EN_PERI_DMA_SHIFT;
        break;
      case K210_CLOCK_AI:
        *bit = CLK_EN_PERI_AI_SHIFT;
        break;
      case K210_CLOCK_DVP:
        *bit = CLK_EN_PERI_DVP_SHIFT;
        break;
      case K210_CLOCK_FFT:
        *bit = CLK_EN_PERI_FFT_SHIFT;
        break;
      case K210_CLOCK_GPIO:
        *bit = CLK_EN_PERI_GPIO_SHIFT;
        break;
      case K210_CLOCK_SPI0:
        *bit = CLK_EN_PERI_SPI0_SHIFT;
        break;
      case K210_CLOCK_SPI1:
        *bit = CLK_EN_PERI_SPI1_SHIFT;
        break;
      case K210_CLOCK_SPI2:
        *bit = CLK_EN_PERI_SPI2_SHIFT;
        break;
      case K210_CLOCK_SPI3:
        *bit = CLK_EN_PERI_SPI3_SHIFT;
        break;
      case K210_CLOCK_I2S0:
        *bit = CLK_EN_PERI_I2S0_SHIFT;
        break;
      case K210_CLOCK_I2S1:
        *bit = CLK_EN_PERI_I2S1_SHIFT;
        break;
      case K210_CLOCK_I2S2:
        *bit = CLK_EN_PERI_I2S2_SHIFT;
        break;
      case K210_CLOCK_I2C0:
        *bit = CLK_EN_PERI_I2C0_SHIFT;
        break;
      case K210_CLOCK_I2C1:
        *bit = CLK_EN_PERI_I2C1_SHIFT;
        break;
      case K210_CLOCK_I2C2:
        *bit = CLK_EN_PERI_I2C2_SHIFT;
        break;
      case K210_CLOCK_UART1:
        *bit = CLK_EN_PERI_UART1_SHIFT;
        break;
      case K210_CLOCK_UART2:
        *bit = CLK_EN_PERI_UART2_SHIFT;
        break;
      case K210_CLOCK_UART3:
        *bit = CLK_EN_PERI_UART3_SHIFT;
        break;
      case K210_CLOCK_AES:
        *bit = CLK_EN_PERI_AES_SHIFT;
        break;
      case K210_CLOCK_FPIOA:
        *bit = CLK_EN_PERI_FPIOA_SHIFT;
        break;
      case K210_CLOCK_TIMER0:
        *bit = CLK_EN_PERI_TIMER0_SHIFT;
        break;
      case K210_CLOCK_TIMER1:
        *bit = CLK_EN_PERI_TIMER1_SHIFT;
        break;
      case K210_CLOCK_TIMER2:
        *bit = CLK_EN_PERI_TIMER2_SHIFT;
        break;
      case K210_CLOCK_WDT0:
        *bit = CLK_EN_PERI_WDT0_SHIFT;
        break;
      case K210_CLOCK_WDT1:
        *bit = CLK_EN_PERI_WDT1_SHIFT;
        break;
      case K210_CLOCK_SHA:
        *bit = CLK_EN_PERI_SHA_SHIFT;
        break;
      case K210_CLOCK_OTP:
        *bit = CLK_EN_PERI_OTP_SHIFT;
        break;
      case K210_CLOCK_RTC:
        *bit = CLK_EN_PERI_RTC_SHIFT;
        break;
      default:
        return -EINVAL;
    }

  return OK;
}

/****************************************************************************
 * Name: k210_reset_to_bit
 *
 * Description:
 *   Map a reset ID to its corresponding bit position in PERI_RESET register.
 *
 * Input Parameters:
 *   rstidx - Reset ID to map
 *   bit    - Pointer to store the bit position
 *
 * Returned Value:
 *   OK on success, -EINVAL for invalid reset ID
 *
 ****************************************************************************/

static int k210_reset_to_bit(k210_rstidx_t rstidx, uint32_t *bit)
{
  switch (rstidx)
    {
      case K210_RESET_ROM:
        *bit = PERI_RESET_ROM_SHIFT;
        break;
      case K210_RESET_DMA:
        *bit = PERI_RESET_DMA_SHIFT;
        break;
      case K210_RESET_AI:
        *bit = PERI_RESET_AI_SHIFT;
        break;
      case K210_RESET_DVP:
        *bit = PERI_RESET_DVP_SHIFT;
        break;
      case K210_RESET_FFT:
        *bit = PERI_RESET_FFT_SHIFT;
        break;
      case K210_RESET_GPIO:
        *bit = PERI_RESET_GPIO_SHIFT;
        break;
      case K210_RESET_SPI0:
        *bit = PERI_RESET_SPI0_SHIFT;
        break;
      case K210_RESET_SPI1:
        *bit = PERI_RESET_SPI1_SHIFT;
        break;
      case K210_RESET_SPI2:
        *bit = PERI_RESET_SPI2_SHIFT;
        break;
      case K210_RESET_SPI3:
        *bit = PERI_RESET_SPI3_SHIFT;
        break;
      case K210_RESET_I2S0:
        *bit = PERI_RESET_I2S0_SHIFT;
        break;
      case K210_RESET_I2S1:
        *bit = PERI_RESET_I2S1_SHIFT;
        break;
      case K210_RESET_I2S2:
        *bit = PERI_RESET_I2S2_SHIFT;
        break;
      case K210_RESET_I2C0:
        *bit = PERI_RESET_I2C0_SHIFT;
        break;
      case K210_RESET_I2C1:
        *bit = PERI_RESET_I2C1_SHIFT;
        break;
      case K210_RESET_I2C2:
        *bit = PERI_RESET_I2C2_SHIFT;
        break;
      case K210_RESET_UART1:
        *bit = PERI_RESET_UART1_SHIFT;
        break;
      case K210_RESET_UART2:
        *bit = PERI_RESET_UART2_SHIFT;
        break;
      case K210_RESET_UART3:
        *bit = PERI_RESET_UART3_SHIFT;
        break;
      case K210_RESET_AES:
        *bit = PERI_RESET_AES_SHIFT;
        break;
      case K210_RESET_FPIOA:
        *bit = PERI_RESET_FPIOA_SHIFT;
        break;
      case K210_RESET_TIMER0:
        *bit = PERI_RESET_TIMER0_SHIFT;
        break;
      case K210_RESET_TIMER1:
        *bit = PERI_RESET_TIMER1_SHIFT;
        break;
      case K210_RESET_TIMER2:
        *bit = PERI_RESET_TIMER2_SHIFT;
        break;
      case K210_RESET_WDT0:
        *bit = PERI_RESET_WDT0_SHIFT;
        break;
      case K210_RESET_WDT1:
        *bit = PERI_RESET_WDT1_SHIFT;
        break;
      case K210_RESET_SHA:
        *bit = PERI_RESET_SHA_SHIFT;
        break;
      case K210_RESET_RTC:
        *bit = PERI_RESET_RTC_SHIFT;
        break;
      default:
        return -EINVAL;
    }

  return OK;
}

/****************************************************************************
 * Name: k210_clock_to_apb
 *
 * Description:
 *   Map a clock ID to its APB bus number.
 *
 *   APB0: GPIO, UART1-3, I2S0-2, I2C0-2, FPIOA, TIMER0-2, SHA
 *   APB1: AES, WDT0-1, OTP, RTC
 *   APB2: SPI0, SPI1
 *   Others: ROM, DMA, AI, DVP, FFT, SPI2, SPI3 do not require APB bus clock
 *
 * Input Parameters:
 *   clkid - Clock ID to map
 *
 * Returned Value:
 *   0 for APB0, 1 for APB1, 2 for APB2, -1 if not on APB bus
 *
 ****************************************************************************/

static int k210_clock_to_apb(k210_clockid_t clkid)
{
  switch (clkid)
    {
      case K210_CLOCK_GPIO:
      case K210_CLOCK_UART1:
      case K210_CLOCK_UART2:
      case K210_CLOCK_UART3:
      case K210_CLOCK_I2S0:
      case K210_CLOCK_I2S1:
      case K210_CLOCK_I2S2:
      case K210_CLOCK_I2C0:
      case K210_CLOCK_I2C1:
      case K210_CLOCK_I2C2:
      case K210_CLOCK_FPIOA:
      case K210_CLOCK_TIMER0:
      case K210_CLOCK_TIMER1:
      case K210_CLOCK_TIMER2:
      case K210_CLOCK_SHA:
        return 0;

      case K210_CLOCK_AES:
      case K210_CLOCK_WDT0:
      case K210_CLOCK_WDT1:
      case K210_CLOCK_OTP:
      case K210_CLOCK_RTC:
        return 1;

      case K210_CLOCK_SPI0:
      case K210_CLOCK_SPI1:
        return 2;

      default:
        return -1;
    }
}

/****************************************************************************
 * Name: k210_clock_is_central
 *
 * Description:
 *   Check if a clock ID is a central clock (CPU, SRAM, APB).
 *
 *   Central clocks are controlled via CLK_EN_CENT register, while
 *   peripheral clocks use CLK_EN_PERI register.
 *
 * Input Parameters:
 *   clkid - Clock ID to check
 *
 * Returned Value:
 *   true if central clock, false otherwise
 *
 ****************************************************************************/

static bool k210_clock_is_central(k210_clockid_t clkid)
{
  switch (clkid)
    {
      case K210_CLOCK_CPU:
      case K210_CLOCK_SRAM0:
      case K210_CLOCK_SRAM1:
      case K210_CLOCK_APB0:
      case K210_CLOCK_APB1:
      case K210_CLOCK_APB2:
        return true;
      default:
        return false;
    }
}

/****************************************************************************
 * Name: k210_clock_to_central_bit
 *
 * Description:
 *   Map a central clock ID to its corresponding bit mask in CLK_EN_CENT.
 *
 * Input Parameters:
 *   clkid - Central clock ID to map
 *   mask  - Pointer to store the bit mask
 *
 * Returned Value:
 *   OK on success, -EINVAL for invalid clock ID
 *
 ****************************************************************************/

static int k210_clock_to_central_bit(k210_clockid_t clkid, uint32_t *mask)
{
  switch (clkid)
    {
      case K210_CLOCK_CPU:
        *mask = CLK_EN_CENT_CPU_MASK;
        break;
      case K210_CLOCK_SRAM0:
        *mask = CLK_EN_CENT_SRAM0_MASK;
        break;
      case K210_CLOCK_SRAM1:
        *mask = CLK_EN_CENT_SRAM1_MASK;
        break;
      case K210_CLOCK_APB0:
        *mask = CLK_EN_CENT_APB0_MASK;
        break;
      case K210_CLOCK_APB1:
        *mask = CLK_EN_CENT_APB1_MASK;
        break;
      case K210_CLOCK_APB2:
        *mask = CLK_EN_CENT_APB2_MASK;
        break;
      default:
        return -EINVAL;
    }

  return OK;
}

/****************************************************************************
 * Name: k210_sysctl_enable_apb_clock
 *
 * Description:
 *   Enable the APB bus clock for a peripheral.
 *
 *   K210 peripheral clock enable requires a two-stage process:
 *   1. First enable the corresponding APB bus clock (CLK_EN_CENT)
 *   2. Then enable the peripheral clock (CLK_EN_PERI)
 *
 *   This separation prevents accidental APB clock disable when CPU
 *   manipulates peripheral clock bits.
 *
 * Input Parameters:
 *   clkid - Clock ID of the peripheral
 *
 * Returned Value:
 *   OK on success
 *
 ****************************************************************************/

static int k210_sysctl_enable_apb_clock(k210_clockid_t clkid)
{
  int apb = k210_clock_to_apb(clkid);
  uint32_t regval;

  if (apb < 0)
    {
      return OK;
    }

