apache/nuttx/arch/risc-v/src/k210/k210_sysctl.c
  regval = getreg32(K210_SYSCTL_CLK_EN_CENT);

  switch (apb)
    {
      case 0:
        regval |= CLK_EN_CENT_APB0_MASK;
        break;
      case 1:
        regval |= CLK_EN_CENT_APB1_MASK;
        break;
      case 2:
        regval |= CLK_EN_CENT_APB2_MASK;
        break;
    }

  putreg32(regval, K210_SYSCTL_CLK_EN_CENT);
  return OK;
}

/****************************************************************************
 * Name: k210_sysctl_pll_wait_lock
 ****************************************************************************/

static void k210_sysctl_pll_clear_slip(uint32_t pll_base)
{
  uint32_t regval;

  regval = getreg32(K210_SYSCTL_PLL_LOCK);

  if (pll_base == K210_SYSCTL_PLL0)
    {
      regval |= PLL_LOCK_PLL0_SLIP_CLR;
    }
  else if (pll_base == K210_SYSCTL_PLL1)
    {
      regval |= PLL_LOCK_PLL1_SLIP_CLR;
    }
  else if (pll_base == K210_SYSCTL_PLL2)
    {
      regval |= PLL_LOCK_PLL2_SLIP_CLR;
    }

  putreg32(regval, K210_SYSCTL_PLL_LOCK);
}

static bool k210_sysctl_pll_wait_lock(uint32_t pll_base)
{
  uint32_t timeout = K210_PLL_LOCK_TIMEOUT_US;

  while (timeout-- > 0)
    {
      if (k210_sysctl_pll_is_locked(pll_base))
        {
          return true;
        }

      k210_sysctl_pll_clear_slip(pll_base);
      up_udelay(1);
    }

  return false;
}

/****************************************************************************
 * Name: k210_sysctl_pll_calc_params
 ****************************************************************************/

static bool k210_sysctl_pll_calc_params(uint32_t fin, uint32_t fout,
                                        struct k210_pll_params_s *params)
{
  uint32_t nr;
  uint32_t nf;
  uint32_t od;
  uint64_t best_err = UINT64_MAX;
  uint64_t best_vco = 0;
  uint32_t best_nr = 0;
  bool found = false;

  if (fout == 0 || params == NULL)
    {
      return false;
    }

  for (nr = K210_PLL_NR_MIN; nr <= K210_PLL_NR_MAX; nr++)
    {
      uint64_t ref_hz = fin / nr;

      if (ref_hz < K210_PLL_REF_MIN || ref_hz > K210_PLL_REF_MAX)
        {
          continue;
        }

      for (nf = K210_PLL_NF_MIN; nf <= K210_PLL_NF_MAX; nf++)
        {
          uint64_t vco_hz = ((uint64_t)fin * nf) / nr;

          if (vco_hz < K210_PLL_VCO_MIN || vco_hz > K210_PLL_VCO_MAX)
            {
              continue;
            }

          for (od = K210_PLL_OD_MIN; od <= K210_PLL_OD_MAX; od++)
            {
              uint64_t out_hz = vco_hz / od;
              uint64_t err = out_hz > fout ? out_hz - fout : fout - out_hz;

              if (!found ||
                  err < best_err ||
                  (err == best_err && vco_hz > best_vco) ||
                  (err == best_err && vco_hz == best_vco && nr < best_nr))
                {
                  found = true;
                  best_err = err;
                  best_vco = vco_hz;
                  best_nr = nr;

                  params->clkr = nr - 1;
                  params->clkf = nf - 1;
                  params->clkod = od - 1;
                  params->bwadj = nf - 1;

                  if (err == 0)
                    {
                      return true;
                    }
                }
            }
        }
    }

  return found;
}

/****************************************************************************
 * Name: k210_sysctl_pll_set_freq
 ****************************************************************************/

static uint32_t k210_sysctl_pll_set_freq(uint32_t pll_base, uint32_t freq)
{
  struct k210_pll_params_s params =
  {
    0
  };

  uint32_t regval;
  uint32_t clksel0;

  if (freq == 0 || pll_base != K210_SYSCTL_PLL0)
    {
      return 0;
    }

  if (!k210_sysctl_pll_calc_params(K210_PLL_INPUT_FREQ, freq, &params))
    {
      return 0;
    }

  /* 1. Switch CPU clock to IN0 before touching PLL0 */

  clksel0 = getreg32(K210_SYSCTL_CLKSEL0);
  clksel0 &= ~CLKSEL0_ACLK_SEL_MASK;
  putreg32(clksel0, K210_SYSCTL_CLKSEL0);

  /* 2. Disable PLL output */

  regval = getreg32(pll_base);
  regval &= ~PLL_OUT_EN_MASK;
  putreg32(regval, pll_base);

  /* 3. Power down PLL */

  regval &= ~PLL_PWRD_MASK;
  putreg32(regval, pll_base);

  /* 4. Program PLL parameters */

  regval &= ~(PLL_CLKR_MASK | PLL_CLKF_MASK | PLL_CLKOD_MASK |
              PLL_BWADJ_MASK | PLL_BYPASS_MASK);
  regval |= ((uint32_t)params.clkr << PLL_CLKR_SHIFT);
  regval |= ((uint32_t)params.clkf << PLL_CLKF_SHIFT);
  regval |= ((uint32_t)params.clkod << PLL_CLKOD_SHIFT);
  regval |= ((uint32_t)params.bwadj << PLL_BWADJ_SHIFT);
  putreg32(regval, pll_base);

  /* 5. Power on PLL */

  regval |= PLL_PWRD_MASK;
  putreg32(regval, pll_base);
  up_udelay(1);

  /* 6. Reset PLL and release reset */

  regval &= ~PLL_RESET_MASK;
  putreg32(regval, pll_base);
  regval |= PLL_RESET_MASK;
  putreg32(regval, pll_base);
  up_udelay(1);
  regval &= ~PLL_RESET_MASK;
  putreg32(regval, pll_base);

  /* 7. Wait lock with timeout */

  if (!k210_sysctl_pll_wait_lock(pll_base))
    {
      return 0;
    }

  /* 8. Enable PLL output */

  regval = getreg32(pll_base);
  regval |= PLL_OUT_EN_MASK;
  putreg32(regval, pll_base);

  /* 9. Switch CPU clock back to PLL0 */

  clksel0 = getreg32(K210_SYSCTL_CLKSEL0);
  clksel0 |= CLKSEL0_ACLK_SEL_MASK;
  putreg32(clksel0, K210_SYSCTL_CLKSEL0);

  return k210_sysctl_pll_get_freq(pll_base);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: k210_sysctl_pll_is_locked
 *
 * Description:
 *   Check if a PLL is locked by reading the PLL_LOCK register.
 *
 *   PLL0 requires both overflow and slip bits to be set (value == 3).
 *   PLL1 and PLL2 only check the lock bit.
 *
 * Input Parameters:
 *   pll_offset - PLL register offset (K210_SYSCTL_PLL0/PLL1/PLL2)
 *
 * Returned Value:
 *   true if PLL is locked, false otherwise
 *
 ****************************************************************************/

bool k210_sysctl_pll_is_locked(uint32_t pll_offset)
{
  uint32_t regval = getreg32(K210_SYSCTL_PLL_LOCK);

  if (pll_offset == K210_SYSCTL_PLL0)
    {
      return (regval & (1 << PLL_LOCK_PLL0_SHIFT)) != 0;
    }
  else if (pll_offset == K210_SYSCTL_PLL1)
    {
      return (regval & PLL_LOCK_PLL1_MASK) == PLL_LOCK_PLL1_LOCKED;
    }
  else if (pll_offset == K210_SYSCTL_PLL2)
    {
      return (regval & PLL_LOCK_PLL2_MASK) == PLL_LOCK_PLL2_LOCKED;
    }

