apache/nuttx/arch/risc-v/src/k210/k210_sysctl.c
  return false;
}

/****************************************************************************
 * Name: k210_sysctl_init
 ****************************************************************************/

void k210_sysctl_init(void)
{
  uint32_t clksel0;

  /* Default to ACLK divider /2 */

  clksel0 = getreg32(K210_SYSCTL_CLKSEL0);
  clksel0 &= ~CLKSEL0_ACLK_DIV_MASK;
  putreg32(clksel0, K210_SYSCTL_CLKSEL0);

  k210_sysctl_cpu_set_freq(CONFIG_K210_CPU_FREQ);
}

/****************************************************************************
 * Name: k210_sysctl_cpu_get_freq
 ****************************************************************************/

uint32_t k210_sysctl_cpu_get_freq(void)
{
  return k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
}

/****************************************************************************
 * Name: k210_sysctl_cpu_set_freq
 ****************************************************************************/

uint32_t k210_sysctl_cpu_set_freq(uint32_t freq)
{
  uint32_t actual_pll;
  uint32_t actual;
  uint32_t clksel0;
  uint32_t div_sel;
  uint32_t target_pll;
  uint64_t target64;

  if (freq == 0)
    {
      return 0;
    }

  clksel0 = getreg32(K210_SYSCTL_CLKSEL0);
  div_sel = (clksel0 & CLKSEL0_ACLK_DIV_MASK) >> CLKSEL0_ACLK_DIV_SHIFT;
  target64 = (uint64_t)freq * (uint64_t)(2u << div_sel);
  if (target64 > UINT32_MAX)
    {
      return 0;
    }

  target_pll = (uint32_t)target64;
  actual_pll = k210_sysctl_pll_set_freq(K210_SYSCTL_PLL0, target_pll);

  if (actual_pll == 0)
    {
      return 0;
    }

  actual = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
  return actual;
}

/****************************************************************************
 * Name: k210_sysctl_clock_enable
 *
 * Description:
 *   Enable a peripheral or central clock.
 *
 *   For peripheral clocks, this follows a two-stage process:
 *   1. Enable the corresponding APB bus clock (CLK_EN_CENT)
 *   2. Enable the peripheral clock (CLK_EN_PERI)
 *
 *   For central clocks (CPU, SRAM, APB), only CLK_EN_CENT is used.
 *
 * Input Parameters:
 *   clkid - Clock ID to enable
 *
 * Returned Value:
 *   OK on success, negative error code on failure
 *
 ****************************************************************************/

int k210_sysctl_clock_enable(k210_clockid_t clkid)
{
  uint32_t regval;
  uint32_t bit;
  int ret;

  if (clkid >= K210_CLOCK_MAX)
    {
      return -EINVAL;
    }

  if (k210_clock_is_central(clkid))
    {
      ret = k210_clock_to_central_bit(clkid, &bit);
      if (ret < 0)
        {
          return ret;
        }

      regval = getreg32(K210_SYSCTL_CLK_EN_CENT);
      regval |= bit;
      putreg32(regval, K210_SYSCTL_CLK_EN_CENT);
    }
  else
    {
      ret = k210_sysctl_enable_apb_clock(clkid);
      if (ret < 0)
        {
          return ret;
        }

      ret = k210_clock_to_bit(clkid, &bit);
      if (ret < 0)
        {
          return ret;
        }

      regval = getreg32(K210_SYSCTL_CLK_EN_PERI);
      regval |= (1 << bit);
      putreg32(regval, K210_SYSCTL_CLK_EN_PERI);
    }

  return OK;
}

/****************************************************************************
 * Name: k210_sysctl_clock_disable
 *
 * Description:
 *   Disable a peripheral or central clock.
 *
 *   For peripheral clocks, only the peripheral clock is disabled.
 *   The APB bus clock is kept enabled to protect other peripherals
 *   on the same bus.
 *
 *   For central clocks (CPU, SRAM, APB), CLK_EN_CENT is used.
 *   WARNING: Disabling central clocks can cause system instability.
 *
 * Input Parameters:
 *   clkid - Clock ID to disable
 *
 * Returned Value:
 *   OK on success, negative error code on failure
 *
 ****************************************************************************/

int k210_sysctl_clock_disable(k210_clockid_t clkid)
{
  uint32_t regval;
  uint32_t bit;
  int ret;

  if (clkid >= K210_CLOCK_MAX)
    {
      return -EINVAL;
    }

  if (k210_clock_is_central(clkid))
    {
      ret = k210_clock_to_central_bit(clkid, &bit);
      if (ret < 0)
        {
          return ret;
        }

      regval = getreg32(K210_SYSCTL_CLK_EN_CENT);
      regval &= ~bit;
      putreg32(regval, K210_SYSCTL_CLK_EN_CENT);
    }
  else
    {
      ret = k210_clock_to_bit(clkid, &bit);
      if (ret < 0)
        {
          return ret;
        }

      regval = getreg32(K210_SYSCTL_CLK_EN_PERI);
      regval &= ~(1 << bit);
      putreg32(regval, K210_SYSCTL_CLK_EN_PERI);
    }

  return OK;
}

/****************************************************************************
 * Name: k210_sysctl_clock_get_freq
 *
 * Description:
 *   Get the frequency of a clock.
 *
 *   Clock frequency relationships:
 *   - PLL0/1/2: Calculated from PLL registers
 *   - CPU (ACLK): PLL0 / (2^aclk_div) when aclk_sel=1, else IN0
 *   - APB0: ACLK / (apb0_div + 1)
 *   - APB1: ACLK / (apb1_div + 1)
 *   - APB2: ACLK / (apb2_div + 1)
 *   - Peripheral clocks: Equal to corresponding APB bus frequency
 *
 * Input Parameters:
 *   clkid - Clock ID to query
 *
 * Returned Value:
 *   Clock frequency in Hz, 0 for unknown clocks
 *
 ****************************************************************************/

uint32_t k210_sysctl_clock_get_freq(k210_clockid_t clkid)
{
  uint32_t regval;
  uint32_t div;
  uint32_t source;

  switch (clkid)
    {
      case K210_CLOCK_PLL0:
        return k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);

      case K210_CLOCK_PLL1:
        return k210_sysctl_pll_get_freq(K210_SYSCTL_PLL1);

      case K210_CLOCK_PLL2:
        return k210_sysctl_pll_get_freq(K210_SYSCTL_PLL2);

      case K210_CLOCK_CPU:
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        if (regval & CLKSEL0_ACLK_SEL_MASK)
          {
            source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
            div = (regval >> CLKSEL0_ACLK_DIV_SHIFT) & 0x03;
            return source / (2u << div);
          }
        else
          {
            return K210_PLL_INPUT_FREQ;
          }

      case K210_CLOCK_SRAM0:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLK_TH0);
        div = (regval >> CLK_TH0_SRAM0_SHIFT) & 0x0f;
        return source / (div + 1);

      case K210_CLOCK_SRAM1:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLK_TH0);
        div = (regval >> CLK_TH0_SRAM1_SHIFT) & 0x0f;
        return source / (div + 1);

      case K210_CLOCK_ROM:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLK_TH0);
        div = (regval >> CLK_TH0_ROM_SHIFT) & 0x0f;
        return source / (div + 1);

      case K210_CLOCK_DVP:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLK_TH0);
        div = (regval >> CLK_TH0_DVP_SHIFT) & 0x0f;
        return source / (div + 1);

      case K210_CLOCK_APB0:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        div = (regval >> CLKSEL0_APB0_DIV_SHIFT) & 0x07;
        return source / (div + 1);

      case K210_CLOCK_APB1:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        div = (regval >> CLKSEL0_APB1_DIV_SHIFT) & 0x07;
        return source / (div + 1);

