apache/nuttx/arch/risc-v/src/k210/k210_sysctl.c
      case K210_CLOCK_APB2:
        source = k210_sysctl_clock_get_freq(K210_CLOCK_CPU);
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        div = (regval >> CLKSEL0_APB2_DIV_SHIFT) & 0x07;
        return source / (div + 1);

      case K210_CLOCK_AI:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL1);
        regval = getreg32(K210_SYSCTL_CLK_TH0);
        div = (regval >> CLK_TH0_AI_SHIFT) & 0x0f;
        return source / (div + 1);

      case K210_CLOCK_DMA:
      case K210_CLOCK_FFT:
        return k210_sysctl_clock_get_freq(K210_CLOCK_CPU);

      case K210_CLOCK_SPI0:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
        regval = getreg32(K210_SYSCTL_CLK_TH1);
        div = (regval >> CLK_TH1_SPI0_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_SPI1:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
        regval = getreg32(K210_SYSCTL_CLK_TH1);
        div = (regval >> CLK_TH1_SPI1_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_SPI2:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
        regval = getreg32(K210_SYSCTL_CLK_TH1);
        div = (regval >> CLK_TH1_SPI2_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_SPI3:
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        if ((regval >> 12) & 0x01)
          {
            source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
          }
        else
          {
            source = K210_PLL_INPUT_FREQ;
          }

        regval = getreg32(K210_SYSCTL_CLK_TH1);
        div = (regval >> CLK_TH1_SPI3_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_I2S0:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL2);
        regval = getreg32(K210_SYSCTL_CLK_TH3);
        div = (regval >> CLK_TH3_I2S0_SHIFT) & 0xffff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_I2S1:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL2);
        regval = getreg32(K210_SYSCTL_CLK_TH3);
        div = (regval >> CLK_TH3_I2S1_SHIFT) & 0xffff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_I2S2:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL2);
        regval = getreg32(K210_SYSCTL_CLK_TH4);
        div = (regval >> CLK_TH4_I2S2_SHIFT) & 0xffff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_I2C0:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
        regval = getreg32(K210_SYSCTL_CLK_TH5);
        div = (regval >> CLK_TH5_I2C0_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_I2C1:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
        regval = getreg32(K210_SYSCTL_CLK_TH5);
        div = (regval >> CLK_TH5_I2C1_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_I2C2:
        source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
        regval = getreg32(K210_SYSCTL_CLK_TH5);
        div = (regval >> CLK_TH5_I2C2_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_TIMER0:
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        if ((regval >> 13) & 0x01)
          {
            source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
          }
        else
          {
            source = K210_PLL_INPUT_FREQ;
          }

        regval = getreg32(K210_SYSCTL_CLK_TH2);
        div = (regval >> CLK_TH2_TIMER0_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_TIMER1:
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        if ((regval >> 14) & 0x01)
          {
            source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
          }
        else
          {
            source = K210_PLL_INPUT_FREQ;
          }

        regval = getreg32(K210_SYSCTL_CLK_TH2);
        div = (regval >> CLK_TH2_TIMER1_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_TIMER2:
        regval = getreg32(K210_SYSCTL_CLKSEL0);
        if ((regval >> 15) & 0x01)
          {
            source = k210_sysctl_pll_get_freq(K210_SYSCTL_PLL0);
          }
        else
          {
            source = K210_PLL_INPUT_FREQ;
          }

        regval = getreg32(K210_SYSCTL_CLK_TH2);
        div = (regval >> CLK_TH2_TIMER2_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_WDT0:
        source = K210_PLL_INPUT_FREQ;
        regval = getreg32(K210_SYSCTL_CLK_TH6);
        div = (regval >> CLK_TH6_WDT0_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_WDT1:
        source = K210_PLL_INPUT_FREQ;
        regval = getreg32(K210_SYSCTL_CLK_TH6);
        div = (regval >> CLK_TH6_WDT1_SHIFT) & 0xff;
        return source / ((div + 1) * 2);

      case K210_CLOCK_GPIO:
      case K210_CLOCK_UART1:
      case K210_CLOCK_UART2:
      case K210_CLOCK_UART3:
      case K210_CLOCK_FPIOA:
      case K210_CLOCK_SHA:
        return k210_sysctl_clock_get_freq(K210_CLOCK_APB0);

      case K210_CLOCK_AES:
      case K210_CLOCK_OTP:
        return k210_sysctl_clock_get_freq(K210_CLOCK_APB1);

      case K210_CLOCK_RTC:
        return K210_PLL_INPUT_FREQ;

      default:
        return 0;
    }
}

/****************************************************************************
 * Name: k210_sysctl_reset
 *
 * Description:
 *   Reset a peripheral with proper timing sequence.
 *
 *   Reset sequence:
 *   1. Assert reset (set bit in PERI_RESET register)
 *   2. Wait approximately 10us for reset to take effect
 *   3. Deassert reset (clear bit in PERI_RESET register)
 *
 * Input Parameters:
 *   rstidx - Reset ID of the peripheral to reset
 *
 * Returned Value:
 *   OK on success, negative error code on failure
 *
 ****************************************************************************/

int k210_sysctl_reset(k210_rstidx_t rstidx)
{
  uint32_t bit;
  uint32_t regval;
  int ret;

  ret = k210_reset_to_bit(rstidx, &bit);
  if (ret < 0)
    {
      return ret;
    }

  regval = getreg32(K210_SYSCTL_PERI_RESET);

  regval |= (1 << bit);
  putreg32(regval, K210_SYSCTL_PERI_RESET);

  up_udelay(10);

  regval &= ~(1 << bit);
  putreg32(regval, K210_SYSCTL_PERI_RESET);

  return OK;
}

/****************************************************************************
 * Name: k210_sysctl_init_peripheral
 *
 * Description:
 *   Initialize a peripheral by enabling its clock and releasing from reset.
 *
 *   This is a convenience function that combines clock enable and reset
 *   operations for simplified peripheral initialization.
 *
 *   Typical usage:
 *     k210_sysctl_init_peripheral(K210_CLOCK_UART1, K210_RESET_UART1);
 *     k210_sysctl_init_peripheral(K210_CLOCK_SPI0, K210_RESET_SPI0);
 *
 * Input Parameters:
 *   clkid  - Clock ID of the peripheral
 *   rstidx - Reset ID of the peripheral
 *
 * Returned Value:
 *   OK on success, negative error code on failure
 *
 ****************************************************************************/

int k210_sysctl_init_peripheral(k210_clockid_t clkid, k210_rstidx_t rstidx)
{
  int ret;

  ret = k210_sysctl_clock_enable(clkid);
  if (ret < 0)
    {
      return ret;
    }

  ret = k210_sysctl_reset(rstidx);
  if (ret < 0)
    {
      k210_sysctl_clock_disable(clkid);
      return ret;
    }

  return OK;
}
